# parameters
nc: 3  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple

anchors:
  - [21,18, 29,24, 37,29, 42,37, 53,48, 59,38, 77,56, 95,86, 155,116]  # P5/32

backbone:
  # [from, number, module, args]
  [[-1, 1, OctaveCBA, [32, 3, 1, 0, 0.5]],  # 0
   [-1, 1, OctaveCBA, [64, 3, 2]],  # 1-P1/2
   [-1, 1, OctaveBottleneck, [64]],
   [-1, 1, OctaveCBA, [128, 3, 2]],  # 3-P2/4
   [-1, 2, OctaveBottleneck, [128]],
   [-1, 1, OctaveCBA, [256, 3, 2]],  # 5-P3/8
   [-1, 8, OctaveBottleneck, [256]],
   [-1, 1, OctaveCBA, [512, 3, 2]],  # 7-P4/16
   [-1, 8, OctaveBottleneck, [512]],
   [-1, 1, OctaveCBA, [1024, 3, 2]],  # 9-P5/32
   [-1, 4, OctaveBottleneck, [1024]],
   [-1, 1, OctaveCBA, [1024, 3, 2, 0.5, 0]]  # 11
  ]

head:
  [
   [-1, 1, DilatedEncoder, [1024, 512, 4, [2, 4, 6, 8]]],
   [-1, 1, Bottleneck, [1024, False]],
   [-1, 1, Conv, [512, [1, 1]]],
   [-1, 1, Conv, [1024, 3, 1]],
   [-1, 1, Bottleneck, [512, False]],
   [-1, 1, Bottleneck, [512, False]], # 17 (P5/32-large)

   [[17], 1, Detect, [nc, anchors]],   # Detect(P5)
  ]
